config/InformationRegisters/АРМ_РолиФизлиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АРМ_РолиФизлиц</Name>
			<Comment>Для управления правами доступа избранных сотрудников к критически важному функционалу АРМ директора в аптеках.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заведующий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТерМен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СотрудникФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Физлица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Catalogs/Сотрудники_Физлица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Сотрудники_Физлица</Name>
			<Comment>Используется для мотивации. Для привязки персональных продаж к физлицам.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОператорККМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БДИсточник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОсновногоМестаРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторAVE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторAVE1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/CommonModules/УЗ_РегламентныеЗадания/Ext/Module.bsl
Процедура УЗ_ВыгрузкаСотрудниковФизлиц_В_АМ3(Аптека = Неопределено) Экспорт
	//формирование ХМЛ строки и запись её в регистр сведений откуда АМ забирает данные
	Запрос=Новый запрос();
	
	Запрос.Текст= "ВЫБРАТЬ
	              |	ВЫБОР
	              |		КОГДА Сотрудники_Физлица.ПометкаУдаления = ИСТИНА
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК is_deleted,
	              |	Сотрудники_Физлица.Код КАК tabnum,
	              |	Сотрудники_Физлица.Код КАК login_key,
	              |	Сотрудники_Физлица.Фамилия КАК surname,
	              |	Сотрудники_Физлица.Имя КАК first_name,
	              |	Сотрудники_Физлица.Отчество КАК middle_name,
	              |	ВЫБОР
	              |		КОГДА Сотрудники_Физлица.ОператорККМ = ИСТИНА
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК ecr_operator,
	              |	ЕСТЬNULL(АРМ_РолиФизлиц.Пароль, """") КАК password,
	              |	ЕСТЬNULL(АРМ_РолиФизлиц.Заведующий, ЛОЖЬ) КАК has_role_2,
	              |	ЕСТЬNULL(АРМ_РолиФизлиц.ТерМен, ЛОЖЬ) КАК has_role_3,
	              |	Сотрудники_Физлица.ИНН КАК INN
	              |ИЗ
	              |	Справочник.Сотрудники_Физлица КАК Сотрудники_Физлица
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АРМ_РолиФизлиц КАК АРМ_РолиФизлиц
	              |		ПО (АРМ_РолиФизлиц.СотрудникФизлицо = Сотрудники_Физлица.Ссылка)"; // Сгенерировано в GtG's Консоль запросов. 27.12.2015 11:39:31

 РЕЗЗАПРОСА=Запрос.Выполнить().Выгрузить(); // ~5000...15000 строк
 
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьТекста(ИмяФайла,"windows-1251");
 
 
ЗаписьXML.ЗаписатьСтроку("<?xml version=""1.0"" encoding=""WINDOWS-1251""?>
|<document>
|<pack_type>ACL</pack_type>
|<fmt_ver>1</fmt_ver>
|<user>");

// Обрабатываем в цикле результат запроса -----------------------------------//
Для Каждого Стр Из Реззапроса Цикл                                           //
	
	ЗаписьXML.ЗаписатьСтроку(" <row>");
	
	Для Каждого Кол Из Реззапроса.Колонки Цикл
		ЗначХ=Стр[Кол.Имя];
		Если ТипЗнч(ЗначХ) = Тип("Булево") Тогда
			ЗначХ = Формат(ЗначХ,"ЧН=0; БЛ=0; БИ=1");
		КонецЕсли;
		
		ЗначХ = СтрЗаменить(ЗначХ, "<", "&lt;");
		ЗначХ = СтрЗаменить(ЗначХ, ">", "&gt;");
		ЗначХ = СтрЗаменить(ЗначХ, """", "&quot;");
		ЗначХ = СтрЗаменить(ЗначХ, """", "&apos;");
		ЗначХ = СтрЗаменить(ЗначХ, "/", "&#x2F;"); 
		
		ЗаписьXML.ЗаписатьСтроку("     <"+Кол.Имя+">"+ЗначХ+"</"+Кол.Имя+">" );
		
	Конеццикла;
	ЗаписьXML.ЗаписатьСтроку(" </row>");


КонецЦикла;
//------------------ конец обработки результата запроса ---------------------//
ЗаписьXML.ЗаписатьСтроку("</user>
|</document>");

	ЗаписьXML.Закрыть();
	ЗаписьXML = Новый ЧтениеТекста(ИмяФайла,"windows-1251");
	ТекстУпаковки = ЗаписьXML.Прочитать();
	ЗаписьXML.Закрыть();
	ЗаписьXML = Неопределено;
	УдалитьФайлы(ИмяФайла);	


Обмен.ЗаписатьУпаковкуВРегистрОбмена(Аптека, "ACL" , ТекстУпаковки);


	
КонецПроцедуры

Процедура УЗ_ОбнулениеСостоянияСотрудниковФизлиц() Экспорт
	// Запускается ночью. Обнуляет состояние сотрудников физлиц.
	// При каждой загрузке физлиц из зупов живому проставляется +1.
	
	Запрос=новый Запрос();
	Запрос.Текст="ВЫБРАТЬ
	             |	Сотрудники_Физлица.Ссылка
	             |ИЗ
	             |	Справочник.Сотрудники_Физлица КАК Сотрудники_Физлица";
				 
	Рез=Запрос.Выполнить();			 
				 
	Выб=Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		
		Об=Выб.ПолучитьОбъект();
		Об.Состояние=0;
		Об.Записать();
	КонецЦикла;	
		
	
КонецПроцедуры

Процедура ОбновитьАРМ_РолиФизлиц() Экспорт
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	Сотрудники_Физлица.Ссылка КАК СотрудникФизлицо,
	                |	Сотрудники_Физлица.СНИЛС КАК СНИЛС,
	                |	Сотрудники_Физлица.СпецПароль КАК СпецПароль,
	                |	Сотрудники_Физлица.Должность КАК Должность,
	                |	ВЫБОР
	                |		КОГДА АРМ_РолиФизлиц.СотрудникФизлицо ЕСТЬ NULL
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК СоздатьЭлемент,
	                |	ВЫБОР
	                |		КОГДА НЕ АРМ_РолиФизлиц.СотрудникФизлицо ЕСТЬ NULL
	                |				И (Сотрудники_Физлица.Должность = ""Управляющий аптечными учреждениями""
	                |					ИЛИ Сотрудники_Физлица.Должность = ""Бухгалтер по учету товародвижения в аптеках""
	                |					ИЛИ Сотрудники_Физлица.Должность = ""Заведующий аптечным учреждением""
	                |					ИЛИ Сотрудники_Физлица.Должность = ""Заведующий аптекой""
	                |					ИЛИ Сотрудники_Физлица.Должность = ""Директор(гипер)""
	                |					ИЛИ Сотрудники_Физлица.Должность = ""Бухгалтер"")
	                |				И АРМ_РолиФизлиц.Заведующий = ЛОЖЬ
	                |			ТОГДА ИСТИНА
	                |		КОГДА НЕ АРМ_РолиФизлиц.СотрудникФизлицо ЕСТЬ NULL
	                |				И Сотрудники_Физлица.Должность = ""Директор бизнес единицы""
	                |				И АРМ_РолиФизлиц.ТерМен = ЛОЖЬ
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК Изменить,
	                |	ВЫБОР
	                |		КОГДА Сотрудники_Физлица.Должность = ""Управляющий аптечными учреждениями""
	                |				ИЛИ Сотрудники_Физлица.Должность = ""Бухгалтер по учету товародвижения в аптеках""
	                |				ИЛИ Сотрудники_Физлица.Должность = ""Заведующий аптечным учреждением""
	                |				ИЛИ Сотрудники_Физлица.Должность = ""Заведующий аптекой""
	                |				ИЛИ Сотрудники_Физлица.Должность = ""Директор(гипер)""
	                |				ИЛИ Сотрудники_Физлица.Должность = ""Бухгалтер""
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК Заведующий,
	                |	ВЫБОР
	                |		КОГДА Сотрудники_Физлица.Должность = ""Директор бизнес единицы""
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК ТерМен
	                |ИЗ
	                |	Справочник.Сотрудники_Физлица КАК Сотрудники_Физлица
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АРМ_РолиФизлиц КАК АРМ_РолиФизлиц
	                |		ПО Сотрудники_Физлица.Ссылка = АРМ_РолиФизлиц.СотрудникФизлицо
	                |ГДЕ
	                |	Сотрудники_Физлица.Должность В (""Управляющий аптечными учреждениями"", ""Бухгалтер"", ""Директор(гипер)"", ""Бухгалтер по учету товародвижения в аптеках"", ""Заведующий аптечным учреждением"", ""Заведующий аптекой"", ""Директор бизнес единицы"", ""Заведующий аптечным пунктом"")
	                |	И (ВЫБОР
	                |				КОГДА НЕ АРМ_РолиФизлиц.СотрудникФизлицо ЕСТЬ NULL
	                |						И (Сотрудники_Физлица.Должность = ""Управляющий аптечными учреждениями""
	                |							ИЛИ Сотрудники_Физлица.Должность = ""Бухгалтер по учету товародвижения в аптеках""
	                |							ИЛИ Сотрудники_Физлица.Должность = ""Заведующий аптечным учреждением""
	                |							ИЛИ Сотрудники_Физлица.Должность = ""Заведующий аптекой""
	                |							ИЛИ Сотрудники_Физлица.Должность = ""Директор(гипер)""
	                |							ИЛИ Сотрудники_Физлица.Должность = ""Бухгалтер""
	                |							ИЛИ Сотрудники_Физлица.Должность = ""Заведующий аптечным пунктом"")
	                |						И АРМ_РолиФизлиц.Заведующий = ЛОЖЬ
	                |					ТОГДА ИСТИНА
	                |				КОГДА НЕ АРМ_РолиФизлиц.СотрудникФизлицо ЕСТЬ NULL
	                |						И Сотрудники_Физлица.Должность = ""Директор бизнес единицы""
	                |						И АРМ_РолиФизлиц.ТерМен = ЛОЖЬ
	                |					ТОГДА ИСТИНА
	                |				ИНАЧЕ ЛОЖЬ
	                |			КОНЕЦ = ИСТИНА
	                |			ИЛИ АРМ_РолиФизлиц.СотрудникФизлицо ЕСТЬ NULL)";
	 
	 Рез = Запрос.Выполнить();
	 
	 Выборка = Рез.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 Если Выборка.СоздатьЭлемент = Истина Тогда
			 МЗ = РегистрыСведений.АРМ_РолиФизлиц.СоздатьМенеджерЗаписи();
			 ЗаполнитьЗначенияСвойств(МЗ,Выборка);
			 МЗ.Пароль = ОбщегоНазначения.СгенерироватьПароль(7);
			 МЗ.Записать();
		 Иначе
			 МЗ = РегистрыСведений.АРМ_РолиФизлиц.СоздатьМенеджерЗаписи();
			 МЗ.СотрудникФизлицо = Выборка.СотрудникФизлицо;
			 МЗ.Прочитать();
			 ЗаполнитьЗначенияСвойств(МЗ,Выборка);
			 Если НЕ МЗ.Выбран() Тогда
				 МЗ.Пароль = ОбщегоНазначения.СгенерироватьПароль(7);				 
			 КонецЕсли;
			 МЗ.Записать();
		 КонецЕсли;
		 
	 КонецЦикла;
	 
	 
	 Запрос.Текст = "ВЫБРАТЬ
	                |	АРМ_РолиФизлиц.СотрудникФизлицо КАК СотрудникФизлицо
	                |ИЗ
	                |	РегистрСведений.АРМ_РолиФизлиц КАК АРМ_РолиФизлиц
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники_Физлица КАК Сотрудники_Физлица
	                |		ПО (Сотрудники_Физлица.Ссылка = АРМ_РолиФизлиц.СотрудникФизлицо)
	                |ГДЕ
	                |	
	                |	 НЕ Сотрудники_Физлица.Должность В (""Управляющий аптечными учреждениями"", ""Директор(гипер)"", ""Бухгалтер"", ""Бухгалтер по учету товародвижения в аптеках"" , ""Заведующий аптечным учреждением"", ""Заведующий аптекой"", ""Директор бизнес единицы"")";
	 
	 Рез = Запрос.Выполнить();
	 Если Рез.Пустой() Тогда
		 Возврат;
	 КонецЕсли;
	 
	 Выборка = Рез.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 МЗ = РегистрыСведений.АРМ_РолиФизлиц.СоздатьМенеджерЗаписи();
		 МЗ.СотрудникФизлицо = Выборка.СотрудникФизлицо;
		 МЗ.Прочитать();		 
		 Если МЗ.Выбран() Тогда
			 МЗ.Удалить();
		 КонецЕсли;
	 КонецЦикла;
	 
	 
	
 КонецПроцедуры
